input: "data"
input_dim: 1
input_dim: 1
input_dim: 120
input_dim: 120

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
    param{ 
    name:"conv1_w"
  lr_mult:1
  }
  param{
    name:"conv1_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
    type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
    param{
    name:"conv2_w"
  lr_mult:1
  }
  param{
  name:"conv2_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }	
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
    param{
    name:"conv3_w"
  lr_mult:1
  }
  param{
      name:"conv3_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 512
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4"
    param{
    name:"conv4_w"
  lr_mult:1
  }
  param{
      name:"conv4_b"
  lr_mult:2
  }
  convolution_param {
    #num_output: 256
    #kernel_size: 5
    num_output: 512
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "ip11"
  type: "InnerProduct"
  bottom: "pool4"
  top: "ip11"
  param{
   name: "ip11_w"
  lr_mult:1
  }
  param{
    name: "ip11_b"
  lr_mult:2
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu11"
  type: "PReLU"
  bottom: "ip11"
  top: "ip11"
}